# generate with `brew bundle dump --file=~/dotfiles/Brewfile`
# install with `brew bundle install --file=~/dotfiles/Brewfile`
# https://homebrew-file.readthedocs.io/en/latest/usage.html#brewfile

tap "homebrew/bundle"

# Mac App Store cli installer
brew "mas"

# programs
brew "bash"
brew "bat"
brew "coreutils"
brew "fzf"
brew "git"
brew "jq"
brew "libpcap"
brew "minicom"
brew "mtr"
brew "nano"
brew "neofetch"
brew "nmap"
brew "openssh"
brew "pandoc"
brew "picocom"
brew "python"
brew "ripgrep"
brew "ruff"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"

# casks
cask "aldente"
cask "alt-tab"
cask "apptivate"
cask "basictex"
cask "bruno"
cask "discord"
cask "drawio"
# cask "fliqlo" # clock screensaver
cask "ghostty"
cask "karabiner-elements"
cask "jordanbaird-ice"
cask "linearmouse"
cask "microsoft-edge"
cask "obsidian"
cask "postman"
cask "powershell"
cask "rectangle-pro"
cask "rustdesk"
cask "sequel-pro"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
cask "wireshark"
cask "zotero"

# fonts
brew "cascadia"
cask "font-cascadia-mono"
cask "font-sf-mono"
cask "font-0xproto-nerd-font"
cask "font-sauce-code-pro-nerd-font"
