# generate with `brew bundle dump --file=~/dotfiles/Brewfile`
# install with `brew bundle install --file=~/dotfiles/Brewfile`

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Mac App Store cli installer
brew "mas"

# programs
brew "bash"
brew "git"
brew "jq"
brew "libpcap"
brew "minicom"
brew "nano"
brew "neofetch"
brew "pandoc"
brew "picocom"
brew "python"
brew "speedtest-cli"
brew "stow"
brew "telnet"
brew "tmux"
brew "wget"

# casks
cask "aldente"
cask "alt-tab"
cask "basictex"
cask "bruno"
cask "karabiner-elements"
cask "linearmouse"
cask "powershell"
cask "rectangle-pro"
cask "spotify"
cask "wezterm"
cask "wireshark"

# fonts
brew "cascadia"
cask "font-cascadia-mono"
cask "font-sf-mono"